# 2) კომენტარების სახით თქვენი სიტყვებით ახსენით ყველა მონაცემთა ტიპი (string, integer, float)

# 3) კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის ცვლადი და რაში ვიყენებთ მათ.

# 4) print() ფუნქციის დახმარებით დაბეჭდეთ 5 string ტიპის მნიშნელობა, 5 integer ტიპის მნიშვნელობა, 5 float ტიპის მნიშვნელობა.

# 5) შექმენით 5 სხვადასხვა ცვლადი. ცვლადებში შეინახეთ თქვენთვის სასურველი მნიშვნელობები და შემდეგ დაბეჭდეთ ერთი დიდი წინადადება ერთი print() ფუნქციის მეშვეობით.

# 6) გააკეთეთ 3-3 მაგალითი ყველა მათემატიკურ ოპერაციებზე.

# 7) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი termian-ში.
 





#string სტრინგი არის როდესაც იყენებ ბრჭყალებს "". სტრინგის დროს რაც არ უნდა ჩაწერო
#იგივეს გამოიტანს, სტრინგიტ მხოლოდ დამატება და გამრავლება შეგილია(თუ ერთრთი მოდული ციფრია) მაგალითდ
print ("giorgis")
print("giorgis"+"lasha")
#ასევე შეგილია მიანიჭო სახელი მაგალითად
print (10 * "SABA")


#integer უბრალოდ რიცხვები/ციფრები მაგ:1,2,3,4,5,6....20,21,22 ა.შ ჩვენ შჰეგვილია ისინი ერთმანეთს მივუმატოთ
print (10+11)

#გამოვაკლოთ 
print (10-5)

#გავამრავლოთ
print(10*11)

#გავყოთ
print (100/10)

#float არის ეგრეწოდიბული (ათწილადები) 1.9,2.8,100.9, ა.შ
#ვიღებთ პასუხის დროს მაგალითად
print (10/6)
#თუ არ გვინდა float და გვინდა გამოვიყენოთ integer მაშინ შეგვილია გამოვიყენოთ ორმაგი გამრავლება //
print (10//6)
#რაც წერს რამდენჯერ მოხვდება გამყოფი გასაყოფშ

#ასევე არსებობს boolean რომელიც ჯერ არ გაგვლია :(

#ცვლადი (varieble) ინახავს მოანცემებს მაგალითად
num="11"
car_brand="bmw"
print(num+car_brand)
#ჩვენ ცვალების მხოლოდ მიმატება შეგვილია(თუ იგი ციპფრი არაა ხოლო თუ ციფრია მაშინ ყვეალერი შეგვილია ზ).... გამრავლება,გამოკლება,გაყოფა არ შეგვილა რადგან იგი string შია

#davaleba 4

print("hello world")
print("good night")
print("G")
print("O")
print("A")

print(1+1)
print(2-1)
print(1000000000000000000000/1000000000)
print(10*28)
print(27//11)

print(10/4)
print(11-1.6)
print(12*1.7)
print(16+16,222)
print(222//100.1)

#davaleba5
name_me = " saba "
surname =" gvenetadze "
age =" 15 "
fav_color=" gray "
fav_film=" clocwork orange "
print(name_me +surname+age+fav_color+fav_film)


#6 davaleba
print (2+4)
print (4+1000000)
print (89+90)


print (100-10)
print (10-1)
print (12-11)


print (11*123)
print (132*22)
print (12*121)


print (12/12)
print (21/7)
print (21/3)


print (100//11)
print (10000/2222)
print (132/5)




#davaleab 7 
num1 = 10
num2 = 11
num3 = 1111

print(num1+num2+num3)

